In [ ]:
#display employees in department 30
#display names,empcode and deptcode for all clerks
#display names of employees whose commission is 30% of their salaries
#display names,job,salary of all employees in dept =20 and who earn more than 2000
#display all salesman in dept 30 whose salary is greater than 1500
#display all the managers in any department and clerks in department 20
#display all the managers in department 10 and all the clerks in department 20 and all employees who are neither managers nor clerks but whose salary is more than 2000

In [40]:
print(data)

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0  13-06-1993   800     0.0      20
1    7499   ALLEN   SALESMAN  7698.0  15-08-1998  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0  26-03-1996  1250   500.0      30
3    7566   JONES    MANAGER  7839.0  31-10-1995  2975     NaN      20
4    7698   BLAKE    MANAGER  7839.0  11-06-1992  2850     NaN      30
5    7782   CLARK    MANAGER  7839.0  14-05-1993  2450     NaN      10
6    7788   SCOTT    ANALYST  7566.0  05-03-1996  3000     NaN      20
7    7839    KING  PRESIDENT     NaN  09-06-1990  5000     0.0      10
8    7844  TURNER   SALESMAN  7698.0  04-06-1995  1500     0.0      30
9    7876   ADAMS      CLERK  7788.0  04-06-1999  1100     NaN      20
10   7900   JAMES      CLERK  7698.0  23-06-2000   950     NaN      30
11   7934  MILLER      CLERK  7782.0  21-01-2000  1300     NaN      10
12   7902    FORD    ANALYST  7566.0  05-12-1997  3000     NaN      20
13   7654  MARTIN   SALESMAN  7698.0  05-12-1998  1250  1400.0      30

In [39]:
import pandas as pd
data=pd.read_csv("Employee.csv")
d=pd.DataFrame(data,columns=["ename","deptno"])
d.loc[d["deptno"]==30]

     ename  deptno
1    ALLEN      30
2     WARD      30
4    BLAKE      30
8   TURNER      30
10   JAMES      30
13  MARTIN      30

In [49]:
d=pd.DataFrame(data,columns=["ename","empno","job","deptno"])
#print(d)
d=d.loc[d["job"]=="CLERK"]
del d['job']
print(d)

     ename  empno  deptno
0    SMITH   7369      20
9    ADAMS   7876      20
10   JAMES   7900      30
11  MILLER   7934      10

In [56]:
d=pd.DataFrame(data,columns=["ename","sal","comm"])
d=d.loc[d["sal"]==0.3*d["sal"]]
print(d)

Empty DataFrame
Columns: [ename, sal, comm]
Index: []

In [62]:
d=pd.DataFrame(data,columns=["ename","job","sal","deptno"])
d=d.loc[d["deptno"]==20 ]
d=d.loc[d["sal"]>2000]
del d["deptno"]
print(d)

    ename      job   sal
3   JONES  MANAGER  2975
6   SCOTT  ANALYST  3000
12   FORD  ANALYST  3000